{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "userDefinedMetadata": {"signature": {"inputs": {"input_3:0": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "input_4:0": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "input_5:0": {"name": "input_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "64"}]}}, "Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "256"}]}}, "Identity_5:0": {"name": "Identity_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "512"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "128"}]}}, "Identity_4:0": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "512"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sub_1/Sub_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_33", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_variance_1/variance_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_1/AddV2_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_variance/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2/AddV2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean_1/mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv1/Relu", "op": "_FusedConv2D", "input": ["input_3", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv1/Relu_1", "op": "_FusedConv2D", "input": ["input_4", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sub_1/Sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sub_1/Sub_1/x", "input_5"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv1/Relu", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv1/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv2/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv1/Relu_1", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_pool/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_conv2/Relu_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_pool/MaxPool", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv1/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block1_pool/MaxPool_1", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv1/Relu", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv1/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv2/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv1/Relu_1", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_pool/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_conv2/Relu_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_pool/MaxPool", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv1/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block2_pool/MaxPool_1", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv1/Relu", "unknown_9", "unknown_10"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "Identity_3", "op": "Identity", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv1/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv2/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv1/Relu_1", "unknown_9", "unknown_10"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv2/Relu", "unknown_11", "unknown_12"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv3/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv2/Relu_1", "unknown_11", "unknown_12"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv3/Relu", "unknown_13", "unknown_14"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv4/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv3/Relu_1", "unknown_13", "unknown_14"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv4/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_pool/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_conv4/Relu_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_pool/MaxPool", "unknown_15", "unknown_16"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block3_pool/MaxPool_1", "unknown_15", "unknown_16"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean/mean", "op": "Mean", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean/mean/reduction_indices"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Mul_1/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sub_1/Sub_1", "StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_4", "op": "Identity", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean_1/mean_1", "op": "Mean", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu_1", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean_1/mean_1/reduction_indices"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sub/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean/mean"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_SquaredDifference/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean/mean"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_SquaredDifference_1/SquaredDifference_1", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Encoder/block4_conv1/Relu_1", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean_1/mean_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_variance/variance", "op": "Mean", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_SquaredDifference/SquaredDifference", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_variance/variance/reduction_indices"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_variance_1/variance_1", "op": "Mean", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_SquaredDifference_1/SquaredDifference_1", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_variance_1/variance_1/reduction_indices"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_variance/variance", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2/AddV2/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_1/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_variance_1/variance_1", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_1/AddV2_1/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sqrt/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2/AddV2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sqrt_1/Sqrt_1", "op": "Sqrt", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_1/AddV2_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_RealDiv/RealDiv", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sub/Sub", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sqrt/Sqrt"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Mul/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Sqrt_1/Sqrt_1", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_RealDiv/RealDiv"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_2/AddV2_2", "op": "AddV2", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Mul/Mul", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_mean_1/mean_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_5", "op": "Identity", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_2/AddV2_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Mul_2/Mul_2", "op": "Mul", "input": ["input_5", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_2/AddV2_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_3/AddV2_3", "op": "AddV2", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Mul_1/Mul_1", "StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_Mul_2/Mul_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv1_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/tf_op_layer_AddV2_3/AddV2_3", "unknown_17", "unknown_18"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv1_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv1_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/Shape", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice/stack", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice/stack_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/Shape_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice_1/stack", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice_1/stack_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/strided_slice_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/resize/size", "op": "Pack", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/mul", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/mul_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv1_1/Relu", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/resize/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up1/resize/ResizeNearestNeighbor", "unknown_19", "unknown_20"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_1/Relu", "unknown_21", "unknown_22"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_2/Relu", "unknown_23", "unknown_24"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_3/Relu", "unknown_25", "unknown_26"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/Shape", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice/stack", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice/stack_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/Shape_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice_1/stack", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice_1/stack_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/strided_slice_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/resize/size", "op": "Pack", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/mul", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/mul_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv2_4/Relu", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/resize/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv3_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up2/resize/ResizeNearestNeighbor", "unknown_27", "unknown_28"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv3_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv3_1/Relu", "unknown_29", "unknown_30"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv3_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv3_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/Shape", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice/stack", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice/stack_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/Shape_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice_1/stack", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice_1/stack_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/strided_slice_1", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/resize/size", "op": "Pack", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/mul", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/mul_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv3_2/Relu", "StatefulPartitionedCall/Style_Transfer_Network/Decoder/up3/resize/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Style_Transfer_Network/Decoder/conv4_1/Relu", "op": "_FusedConv2D", "input": 